Healthy/0/p
/*--------------------------------*- C++ -*----------------------------------*\n  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
{
        type            zeroGradient;
}

    RMPA
{
        type            fixedValue;
        value           uniform 2.443761;
}

    LMPA
{
        type            fixedValue;
        value           uniform 2.470848;
}

    wall
{
        type            zeroGradient;
}
}
// ************************************************************************* //