Healthy/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
        //nCellsInCoarsestLevel 120;
    }

        pFinal
    {
        $p;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|tracer)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }

    "(U|tracer)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
}

//relaxationFactors
//{
//    equations
//    {
//        U               0.6; // 0.9 is more stable but 0.95 more convergent
//        ".*"            0.7; // 0.9 is more stable but 0.95 more convergent
//    }
//}


// ************************************************************************* //
